# Миллионами в Test::More в рамках файла тесты лучше не гонять :)
for my $i (1 .. 1_000_000) {
    ok(1, "test $_");
    if ( $i == 1 || $i % 200_000 == 0 ) {
        show_mem();
    }
}
#            Test::More                    Test2::V0;         
# tests   RSS     HWM     VMS      # tests   RSS    HWM     VMS
#        (MiB)   (MiB)   (MiB)              (MiB)  (MiB)  (MiB)
#     1   11.1    11.1    16.6     #     1   15.2   15.2   20.4
#  200k  121.9   121.9   127.3     #  200k   15.2   15.2   20.4
#  400k  232.8   232.8   238.1     #  400k   15.2   15.2   20.4
#  600k  343.2   343.2   348.6     #  600k   15.2   15.2   20.4
#  800k  454.6   454.6   459.9     #  800k   15.2   15.2   20.4
# 1000k  565.0   565.0   570.4     # 1000k   15.2   15.2   20.4
